{
    "0": {
        "title": "Business Development Manager",
        "location": "Barcelona, Spain",
        "date": "20 February 2018",
        "content": "We are looking for a&nbsp; Business Development Manager&nbsp;to join our Barcelona Office and assist us in growing our Content Marketing and Outreach department. The Business Development Manager will work to retain and expand current accounts as well as diversify our current client portfolio. The successful candidate will possess a deep understanding of B2B sales and Content Marketing and how it is applied to improving search engine visibility today.\r\n The main duties and responsibilities include&nbsp;but are not limited to:Prospect for potential new clients and business leads in B2B segment.Cold call as needed within your market or geographic area to ensure a robust pipeline of opportunities.&nbsp;Meet potential clients by growing, maintaining, and leveraging our and your network.Identify potential clients and the decision makers within the client’s organization.Research and build relationships with new clients. Set up meetings between client decision makers and company practice leaders\/Principals.Plan approaches and pitches.&nbsp;Work with the current team to develop proposals that speak to the client’s needs, concerns, and objectives.Handle objections by clarifying, emphasizing agreements and working through differences to a positive conclusion.Use a variety of styles to persuade or negotiate appropriately.Present new products and services and enhance existing relationships.Work with technical staff and other internal colleagues to meet customer needs.Arrange and participate in internal and external client debriefs.Attend industry functions, such as association events and conferences, and provide feedback and information on market and creative trends.Present to and consult with mid and senior level management on business trends with a view to developing new services, products, and distribution channels.Identify opportunities for campaigns, services, and distribution channels that will lead to an increase in sales.Use market knowledge and competitors to identify and develop the company’s unique selling propositions and differentiators.Requirements:3-5 years in B2B sales and digital marketing experience.&nbsp;Previous experience in B2B sales of service in the area of digital marketing.A relevant bachelor&#39;s degree would be considered as an advantage.We offer:Fully equipped open-space.Semi-flexible working hours.Learning opportunities, professional development.Competitive salary.",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=e30da088-71b9-4598-9680-4644f6abf664"
    },
    "1": {
        "title": "RELIABLE CONTENT WRITERS WANTED",
        "location": "Remote",
        "date": "20 February 2018",
        "content": "iBus Media - one of the world's leading companies in iGaming industry is currently looking for freelance content providers. You will be asked to write 500-700 word articles for different websites and topics.&nbsp;   What we’re looking for is speed, dependability and high attention to detail. We need experienced writers who know how to create web articles on various topics, format them properly, and include high quality internal and external links.   Positions are available within the following languages: Portuguese (Portugal), German, French and Romanian. We also look for the high volume writers&nbsp;in Finnish language, that could cake on 30-70 articles a month.   If you have solid writing\/editing skills, please get in touch! SEO knowledge is an asset.    Interested? Don’t hesitate to send your application to&nbsp; daiva.juskiene&#64;ibusmedia.com .&nbsp; Job Type: Part Time  \tDepartment:  \tContent",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=6c226a47-b84a-44c7-86dd-2caf6811c981"
    },
    "2": {
        "title": "SEO Manager",
        "location": "Vilnius",
        "date": "14 March 2018",
        "content": "iBus Media is looking for a SEO Manager who will be able to develop and drive the Search Engine Optimization (SEO) within the organisation and partners with internal and external teams to achieve results.  &nbsp;  Responsibilities :  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Understand both on-site and off-site SEO practices;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Develop and execute SEO strategies and campaigns;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to create a keyword platform \/ semantic core for a new project;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to analyse and sort big amounts of data;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to identify the value of internet asset;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Develop and execute link-building activities;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Perform regular SEO analysis, present recommendations for optimization of content and architecture and implement in cooperation with web development and country managers;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Monitor and report on progress and developments for sites;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Cooperate with co-workers and external partners to ensure SEO best practices are met.  &nbsp;  Requirements :  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Passionate about SEO and Digital Marketing;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Detailed understanding of SEO principles and guidelines required;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience with various SEO tools;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Must have hands on previous experience. Experience cannot be limited to working through an agency;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Great understanding of website architecture;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Follow industry news and ready to implement new practices for ongoing projects;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Ready to take risks and responsibilities for your decisions;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Skill with computers and proficiency in Microsoft Windows, Word and Excel required;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  A fluent level of verbal and written English skills is expected;  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Analytical thinking.  &nbsp;   About &nbsp; iBus &nbsp; Media &nbsp;    &nbsp;  \r\n iBus &nbsp; Media is an international company with a true modern day philosophy which publishes websites in more than 26 different languages, and caters to an audience of over 40m annually. &nbsp;  Based in the Isle of Man with offices in Barcelona, Vilnius, and London, &nbsp; iBus &nbsp; Media is a leader in the online poker news and reporting, sports betting, and casino verticals. &nbsp;   &nbsp;   Its premier website, PokerNews.com, produces fresh content daily from operations in almost 30 &nbsp; countries and continues to be the best and most trusted source of content for poker players, enthusiasts, and key-operators in the gambling industry. &nbsp;  iBus &nbsp; Media has also branched out into other verticals covering sports, online casinos, and more bringing the attention to detail that has always characterized &nbsp; PokerNews &nbsp; to a whole new audience of sports fans, sports betting enthusiasts, and casino lovers. &nbsp;  &nbsp; &nbsp;     \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=e913e6bd-205f-4f71-84dd-27106c3e5e24"
    },
    "3": {
        "title": "PHP Developer",
        "location": "Vilnius",
        "date": "23 March 2018",
        "content": "iBus Media LT is looking for an experienced PHP developer who wants to join a&nbsp;team that works on and develops in-house web-based projects, mobile apps and data analytics systems in realms including, but not limited to: poker, sports and online affiliates. As a&nbsp;team member, you will be responsible for the development of new and support of existing features, modernising codebase in accordance with state-of-art technology. \r\n\r\n  \r\n\r\nFor the position, you should be comfortable with: \r\nSymfony 3-4, Doctrine ORM, Guzzle, third party integrations (APIs). Reading and understanding unfamiliar code, including legacy one. Architectural thinking how to evolve legacy projects to meet industry standarts. Switching from ORM to SQL when appropriate, understanding MySQL performance. Using Linux for basic dev-ops and development. Using Git and git-flow. Estimating work and working in scum sprints, communicating effectively with a&nbsp;project manager and other sprint members. Working without much technical supervision when necessary, while keeping code maintainable and understandable. Code quality&nbsp; over speed of development. Speaking in English. \r\nBonus points for: \r\nExperience with continuous integration and continuous delivery. Experience with MSSQL. Familiar with Agile Kanban. We offer: \r\n\r\nAn exciting opportunity to be part of a&nbsp;dynamic global organization and work with experienced professionals. You will discover a&nbsp;high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n\r\nConfidentiality is guaranteed. \r\n\r\nPlease send your CV in English. Only successful candidates will be contacted. \r\n   \tDepartment:  \tProduct & Services",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=821ea5a4-4a3f-4f0a-a683-2ca1ff9a71b0"
    },
    "4": {
        "title": "Head of B2C",
        "location": "Vilnius",
        "date": "06 April 2018",
        "content": "As the Head of B2C you will be building and excecuting a sales strategy for our sales and media teams to drive business development and increase profit. You would be overseeing and managing the following teams: sales, media buy and affiliates. &nbsp;   &nbsp;   Key responsibilities:   • To develop a strategy and key relationships with our current partners and continue to grow our client base in line with our company goals;   • Identifying valuable emerging markets;   • Accurately forecasting future sales and forming sales plans to adapt to constant shifts in the marketplace;   • Serving as a business representative at major industry events, conferences, trade shows, and expositions;   • Maximising company profit;   • Foreseeing and avoiding stagnation in the marketplace;   • Forming sales strategies to keep our company competitive and innovative;   • Relentlessly create revenue growth through innovative strategies and meticulous execution to deliver step change improvements in performance;   • Analyze campaigns for effectiveness and ROI, including understanding and defining marketing-sourced, marketing-influenced campaigns and revenue impact;   • To develop talent within the organization, mentoring\/developing team.     &nbsp;     Requirements:   • Solid business acumen, and problem-solving skills;   • Digital marketing experience (media campaigns, social media, PPC);   • Previous experience in the affiliate business;   • Ability to develop strong relationships at all levels of the organisation;   • Strong leader and people manager;   • Ability to compile and analyse performance data to develop metrics that support decision making;   • 2-4 years of experience in sales or service strategies;   • Ability to communicate complex ideas in a clear, concise manner both verbally and in writing;   • Ability to work under pressure and to tight deadlines.   • To demonstrate independent thinking and good clear judgement. Motivate sales teams to achieve targets. Logical and well organised with exceptional attention to detail; &nbsp; We Offer An exciting opportunity to be part of a&nbsp;dynamic global organization and work with experienced professionals. You will discover a&nbsp;high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n\r\nConfidentiality is guaranteed. \r\nPlease send your CV in English. Only successful candidates will be contacted. &nbsp;   \tDepartment:  \tB2C",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=ea047e9c-6813-4a78-bb50-fb3d9bbe15cf"
    },
    "5": {
        "title": "Head of B2B",
        "location": "Vilnius",
        "date": "06 April 2018",
        "content": "We are looking for an addition to our management team to lead our B2B services teams in Barcelona and Kaunas. Services include but are not limited to: search engine optimization, web site building and software services development &amp; maintenance.   Key responsibilities:   • Build strong communication channels at all levels of organization, set proper expectations, provide clear status communications, and manage towards a growth plan; \r\n• Analyze the business and conduct deep dive analysis. Publish recommendations and action plans based on data; \r\n• Manage multiple projects concurrently with the daily production environment, such as competitive analysis, and sales analysis as required by the business; \r\n• Develop business opportunities in target markets using the sales team for support; \r\n• Build win-win relationships that may open doors with key partners, prospects and clients; \r\n• Provide input towards the product development’s direction. \r\n&nbsp;   Requirements: • Solid business acumen and problem-solving skills; \r\n• Ability to develop strong relationships at all levels of the organization; \r\n• Ability to compile and analyze performance data to develop metrics that support decision making; \r\n• 3-4 years’ experience developing and\/or running product and\/or services strategies or equivalent; \r\n• Experience with technically complex products in a digital marketing\/SEO environment; \r\n• Ability to communicate complex ideas in a clear, concise manner both verbally and in writing; \r\n• Ability to work under pressure and to tight deadlines; \r\n• Strong analytical skills and usage of analytical tools such as: Microsoft Excel; \r\n• Ability to work with key stakeholders to reach mutually beneficial agreements; \r\n• Ability to prioritize and manage multiple responsibilities; \r\n• Ability to thrive in an ambiguous environment; \r\n• Strong project management skills; \r\n&nbsp; We Offer An exciting opportunity to be part of a&nbsp;dynamic global organization and work with experienced professionals. You will discover a&nbsp;high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n\r\nConfidentiality is guaranteed. \r\nPlease send your CV in English. Only successful candidates will be contacted. &nbsp;   \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=102275ec-4af3-4f77-8c34-94c6438396f1"
    },
    "6": {
        "title": "Head of Product &amp; Services",
        "location": "Vilnius",
        "date": "06 April 2018",
        "content": "&nbsp;We are looking for an addition to our management team to the lead product and services division in our Vilnius office. The division includes but is not limited to: IT &amp; Development, Data &amp; Analytics, E-mail operation, Product and yield &amp; optimization. The&nbsp; Product &amp; Services  department services other departments within the business such as content, B2C, B2B amongst others.  <\/p>  Key responsibilities:   • Implement business strategy, plans and procedures;\r\n• Set comprehensive goals for performance and growth;\r\n• Establish policies that promote company culture and vision;\r\n• Oversee daily operations (IT &amp; development, data &amp; analytics, e-mail operations, product and yield &amp; optimization);\r\n• Lead employees to encourage maximum performance and dedication;\r\n• Evaluate performance by analyzing and interpreting data and metrics;\r\n• Write and submit reports to the COO in all matters of importance;\r\n• Planning, developing and implementing the operational strategy to meet organisational requirements and expectations within agreed budgets and timescales, producing an efficient, effective and scalable operating platform to meet the organisation‘s goals;\r\n• Provide support to senior management, including but not limited to preparing project documentation and monitoring key project deliverables;\r\n• Build relationships based on empathy, trust, and respect with team members, customers, providers and partners;\r\n• Define success, metrics, and runway for products;\r\n• Define and analyze metrics that inform the success of products.\r\n \r\nRequirements: • Understanding of business functions such as IT, development, data &amp; analytics, yield &amp; optimization, e-mail operations, etc.; \r\n• Demonstrable competency in strategic planning and business development; \r\n• Maximize efficiency in a fast-moving environment where creative solutions are appreciated; \r\n• Working knowledge of data analysis and performance\/operation metrics; \r\n• Working knowledge of IT\/Business infrastructure; \r\n• Proven experience of motivating others to deliver exceptional performance and long-term results; \r\n• Excellent written and spoken communication skills with experience of successfully influencing others, negotiating effectively and winning over audiences with compelling and persuasive presentations; \r\n• Built effective networks both internally and externally and create opportunities for others to work collaboratively. \r\nWe Offer An exciting opportunity to be part of a&nbsp;dynamic global organization and work with experienced professionals. You will discover a&nbsp;high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n\r\nConfidentiality is guaranteed. \r\nPlease send your CV in English. Only successful candidates will be contacted. &nbsp;   \tDepartment:  \tProduct & Services",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=60d8c63a-337f-4a3c-9d3c-8ea11465eccb"
    },
    "7": {
        "title": "SEO Analyst",
        "location": "Vilnius",
        "date": "20 April 2018",
        "content": "The Digital Marketing Analyst is the key member of the team for analysing the effectiveness of the Stars Group SEO efforts and that of its competitors. Reporting into the Head of SEO, the Digital marketing Analyst is responsible for investigating trends and ranking issues, allowing the SEO strategy to be driven by analysis of all relevant data points. Key Responsibilities    Production of regular business reports allowing key stakeholders to be kept up to date with SEO performance.   Bespoke Investigations into ranking issues using all relevant data sources and building reports on these investigation with actionable insights.   Analysis of the effectiveness of campaigns and BAU activities.   Analysis of competitor activities and search engine performance.   Maintenance and management of key SEO tools especially ranking reports and link reports.   Analysis of inbound links to Stars Group web properties to assist Stars Group in defending itself from negative SEO tactics.   Skills and Capabilities    Essential:    Data Analysis skills, especially database management and data science skills.   Ability to analyse large datasets and derive coherent conclusions and trends from the data.   Good coherent communication skills.   Excellent reporting and presentation skills.   Some knowledge of SEO and ranking factors.   Excellent Excel skills.   Ability to work with people with a wide variety of different skills, including editors, marketers, SEO specialists and developers.   Fluent English.   Self-motivated with the ability to work without constant supervision.   Desirable:    Knowledge of SEO platforms including Google Search Console, MajesticSEO, A hrefs, SEOMoz etc.   Experience of doing keyword research.   Experience of optimising and ranking websites.   Experience of other online marketing channels.   Experience and knowledge attribution models.     \tDepartment:  \tProduct & Services",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=1553fa95-7d0b-4e3a-b35c-b839e88b90d5"
    },
    "8": {
        "title": "Programmatic Manager",
        "location": "Barcelona",
        "date": "22 April 2018",
        "content": "Job Description The Programmatic Manager will be responsible for implementation and optimization of approved advertising campaigns through programmatic advertising platforms across display, video, and mobile channels, reporting into the Department Head of Advertising Operations. Key Responsibilities Management of programmatic prospecting and retargeting campaigns across display, video and mobile to meet agreed KPIs including; CPA, CPcV, view ability and unique reach through proactive optimisation, reporting on performance and provision of insights to the business To build and manage the audience modelling strategy utilising the data management platform (DMP) to enable online targeting of high value users and the creation of “lookalike” prospecting campaigns&nbsp;To understand funnel conversion rates, identify channel effectiveness and distribute budget accordingly To manage the relationships with any 3rd party DSPs or programmatic agencies via self-service and managed-service Maintain strong working relationships with the sales, product, and ad ops teams, keeping them informed of any issues or anomalies that impact business To provide technical support when required – i.e troubleshooting, tag sufficiency, trafficking, pixel implementation&nbsp;Skills and Capabilities Essential \r\n+ 3 years relevant experience within digital advertising and RTB Advanced English Experience working on programmatic media buying campaigns, and a proven record of success in optimising programmatic campaigns across various DSPs Experience working with Sizmek and\/or other ad serving technologies Experience of implementation and monitoring of digital ad trafficking including request\/receipt of advertising creative\r\nExperience with tag management platforms (GTM &amp; Signal) Experience with data management platforms (DMPs; BlueKai, Krux) Experience working with mobile measurement platforms (AppsFlyer\/Adjust\/Tune) Possess the ability to work effectively in a highly complex, diverse, changing environment Self-motivated and capable of working independently as well as part of a busy global team Being proactive and committed, continually focused on achieving positive results Excellent communication and presentation skills Excellent numeric skills and attention to detail Advanced Excel skills \r\nDesirable Relevant degree level qualification Fluent in a second language Company offers: An exciting opportunity to be part of a dynamic global organization and work with experienced professionals. You will discover a high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential.   \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=fa461675-e790-4bc7-96f2-dd847b23da41"
    },
    "9": {
        "title": "Programmatic Specialist",
        "location": "Barcelona",
        "date": "22 April 2018",
        "content": "Job Description&nbsp;&nbsp;The ideal candidate will work within our Ad Operations team and the Programmatic Manager to launch and effectively manage data-driven campaigns through Programmatic platforms. The Programmatic Specialist should possess strong understanding of digital media, online advertising, audience segmentation, customer intelligence, research and reporting. Key Responsibilities Setup and traffic placements by agreed, budget, flight times and ad sizes Manage budgets and bids by tactics and strategies in selected demand side platforms Develop and optimize first and third party audience segments Work with media planners and strategists to ensure campaign remains on-target with audience Build, deploy, and test online tracking elements Provide constant, timely internal updates regarding campaigns AB test, recommend improvements and optimize live ad campaigns Establish and maintain relationships with publishers and 3rd party suppliers Effectively prioritize requests, troubleshoot and resolve issues Attend client meetings as necessary to translate campaign insights Keep up to date on all digital media trends Qualifications and Experience\r\n\r\n Skills and Capabilities Essential + 1 year of ad trafficking and campaign management experience Advanced English Good knowledge of the Digital Marketing Eco system, audience segmentations and strategies Good knowledge of buying methods; CPM, CPA, CPL, CPV Experience working with programmatic media buying platforms (MediaMath, DBM) Highly organized and with strong communication and presentation skills, both written and verbal Experience working with ad serving technologies Self-motivated and capable of working independently as well as part of a busy global team \r\nDesirable Relevant degree level qualification Fluent in a second language Knowledge of digital design, ad unit formats, and creative requirements for campaigns Experience with tag management platforms (GTM &amp; Signal) Experience with data management platforms (DMPs; BlueKai, Krux) Experience working with mobile measurement platforms (AppsFlyer\/Adjust\/Tune)  Company offers: An exciting opportunity to be part of a dynamic global organization and work with experienced professionals. You will discover a high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential.  \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=2844746f-3787-4338-a8de-d48ec7dd8ef2"
    },
    "10": {
        "title": "Digital Marketing Coordinator",
        "location": "Barcelona",
        "date": "22 April 2018",
        "content": "Job Purpose&nbsp;&nbsp;&nbsp;  The Digital Marketing Coordinator will be dealing with day-to-day advertising campaign management activities across digital marketing channels. &nbsp; &nbsp; \r\n As Digital Marketing Coordinator, you will help devise and execute cutting edge digital advertising campaigns to drive new customer awareness and subscriptions to our market leading products and brands.\r\nKey Responsibilities Manage and execute creative process underpinning the Digital advertising strategy   Work with Digital      Marketing Managers at planning stage to understand campaign creative asset      requirements   Collaborate with      internal creative agency for creative assets requirements, instructing on      creative offers, creative formats and landing pages, and advise on creative      design and messages   Liaise with      internal creative agency, coordinate reception and storing of all campaign      creatives and send to appropriate stakeholders   Create and      maintain a campaign and promotions calendar, keep track of all offers,      promos and changes   Monitor campaign      creative and promotions performances, advise on testing new creative      messaging, landing pages and offers to optimise performance continuously   Provides      hands on assistance to marketing managers in relations to campaign      preparations and post campaign analysis  Keeping up to date with innovations in digital display advertising and better ways to improve campaign creative assets \r\nSkills and CapabilitiesDegree in business, preferably in Marketing and\/or 2+ year experience in operative digital marketing role Passionate about digital advertising Analytical skills, comfortable with numbers Excellent communication and presentation skills Self-motivated, and capable of working independently as well as part of a busy global team Willing to take initiative, ability to innovate and think creatively Is able to work effectively in a highly complex, diverse, changing environment Adapts and copes successfully with changing circumstances Excellent Excel skills Ability to develop business relationships and clearly present information to senior stakeholders Fluent in English Knowledge of online gaming industry  \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=f691d65e-aaa2-43cf-afaf-752b2722abc9"
    },
    "11": {
        "title": "Sporstbook PPC Manager",
        "location": "Barcelona",
        "date": "22 April 2018",
        "content": "Job Purpose&nbsp;&nbsp;The Sportsbook PPC Manager will be responsible for helping to develop the Sportsbook paid search approach and campaigns, and after Group management approval, assist in the execution of these tactics via multiple search engines and markets with the aim of providing a positive ROI through paid search campaigns. You will be dealing with day-to-day advertising campaign management activities across paid search channels, helping to develop and manage implementation of desktop and mobile advertising campaigns for all our apps, based on direction and guidelines set by Group management.Day-to-Day account optimisation: Monitor budget and adjust bids to gain better ROI; Write attractive and concise copy for adverts; landing page review; impression share and quality score analysis and so on Help building and maintaining positive relationships with country managers, key stakeholders from the Brand and colleagues. Compile and report on campaign effectiveness to Senior Manager, including competitive landscape, KPIs and recommendations on opportunities for growth Gathering actionable data from various sources and report to the Senior Manager in order to help ensure consistent and continual optimisation of the sports betting paid search campaigns. Generation and dissemination of management reporting to ensure that the wider team is aware of campaign performance trends. Work closely with team members to assist in the delivery of  a collaborative strategy Close liaison with natural search specialists to help maximise the Group’s total opportunity from search.&nbsp;Manage the on-going process of establishing and after Group management approval, implementing across the business best practice guidance on a wide number of areas relating to paid search marketing. Manage the day to day relationships with search engine providers in order to stay up to date on upcoming changes and trends\r\n Skills and Capabilities Essential Must be passionate about Search Marketing Must have technical and analytical skills (including experience with Analytics tools) Proven experience in managing complex PPC campaigns with a history of driving ROI for the business Excellent communication and Excel skills Experience in Sportsbook Ability to conceptualise, scope and execute projects to strict deadlines Good team player with excellent inter-personal skills Proven ability to work to strict deadlines coupled with excellent attention to detail Produces outstanding results both professionally and personally by being proactive and committed. Continually focuses on achieving positive results contributing to our business success Managing Complexity: Is able to work effectively in a highly complex, diverse, changing environment. Adapts well to and is energized by change whilst maintaining focus on key business goals and personal objectives. Goal setting\/short term planning: Achieves results by setting goals using quality planning, analysis and decision making. Adapts and copes successfully with changing circumstances. Innovation: Embraces creativity, innovation and is open to new ideas. Innovates to improve current working practices\/products\/technologies to provide business opportunities and results. Have courage: Is proactive, takes initiatives, challenge the status quo and generally seek improvement in everything you do Strive for Excellence: Find ways to do things better and smarter and never compromise on quality Show Passion: Always have a positive can-do attitude; Celebrate success\r\nDesirable Fluent in a second\/third language Experience working with bid management platforms \r\n Our Values Focus on the customer Work as a team Strive for excellence Have courage Show passion",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=22b9105b-9bf1-40c6-9ae7-b2f4d0daad79"
    },
    "12": {
        "title": "Ad Ops Specialist",
        "location": "Barcelona",
        "date": "22 April 2018",
        "content": "Job Description&nbsp;&nbsp;The Ad Ops Specialist will be dealing with day-to-day advertising campaign trafficking activities across display, video and mobile marketing channels, reporting into the Senior Manager, Advertising Operations. The ideal candidate will have a background in digital ad operations and a familiarity with the programmatic ecosystem. Key Responsibilities Upload and traffic creatives received by our internal studio or external suppliers Ensure all creatives, campaigns and placements follow appropriate naming convention Create and traffic new campaigns to high standards Deliver tags and tracking links to both internal teams and 3rd party vendors Troubleshoot Pixels and Third Party Tags Schedule, generate and deliver reports to all stakeholders across the businessSkills and Capabilities Essential 1+ years&#39; experience within digital advertising Strong English language both verbally and in writing Knowledge of the online advertising industry, advertising server technologies and metrics for advertising efficiency Experience working within Ad Ops department Experience working with Sizmek and\/or other advertising server technology Excellent communication and presentation skills Excellent numeric skills, logical thinking combined with great attention to detail Ability to adapt in a highly complex and changing environment Ability to prioritize and organize workload Self-motivated and results driven Capable of working independently as well as part of a busy global team Advanced Excel skillDesirable&nbsp; Experience working with mobile measurement platforms (AppsFlyer\/Adjust\/Tune) HTML, CSS, JavaScript Knowledge of RTB related issues (DSP\/SSP) Our Values Focus on the customer Work as a team Strive for excellence Have courage Show passionCompany offers: An exciting opportunity to be part of a dynamic global organization and work with experienced professionals. You will discover a high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential.",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=ea473e5d-42e0-4604-8ba0-df2882cee56b"
    },
    "13": {
        "title": "SEO Manager",
        "location": "Barcelona",
        "date": "24 April 2018",
        "content": "iBus Media is looking for a SEO Manager who will be able to develop and drive the Search Engine Optimization (SEO) within the organisation and partners with internal and external teams to achieve results.&nbsp;ResponsibilitiesUnderstand both on-site and off-site SEO practices.Develop and execute SEO strategies and campaigns\u2028Can create a keyword platform \/ semantic core for a new project.Can analyze and sort big amounts of dataCan identify the value of internet assetDevelop and execute link-building activities\u2028Perform regular SEO analysis, present recommendations for optimization of content and architecture and implement in cooperation with web development and country managers\u2028Monitor and report on progress and developments for sitesCooperate with co-workers and external partners to ensure SEO best practices are met\r\nRequirements:Passionate about SEO and Digital MarketingDemonstrable detailed understanding of SEO principles and guidelines requiredExperience with various SEO tools.Great understanding of website architectureFollow industry news and ready to implement new practices for ongoing projectsReady to take risks and responsibilities for your decisionsSkill with computers and proficiency in Microsoft Windows, Word and Excel requiredA fluent level of verbal and written English skills is expected&nbsp;Analytical thinking\r\nCompany offers:An exciting opportunity to be part of a dynamic global organization and work with experienced professionals. You will discover a high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential.&nbsp;<\/p>  \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=6dad593c-e790-45be-9011-286902495d12"
    },
    "14": {
        "title": "Head of B2B",
        "location": "Barcelona",
        "date": "25 April 2018",
        "content": "We are looking for an addition to our management team to lead our B2B services teams in Barcelona and Kaunas. Services include but are not limited to: search engine optimization, web site building and software services development &amp; maintenance.   Key responsibilities:   • Build strong communication channels at all levels of organization, set proper expectations, provide clear status communications, and manage towards a growth plan; \r\n• Analyze the business and conduct deep dive analysis. Publish recommendations and action plans based on data; \r\n• Manage multiple projects concurrently with the daily production environment, such as competitive analysis, and sales analysis as required by the business; \r\n• Develop business opportunities in target markets using the sales team for support; \r\n• Build win-win relationships that may open doors with key partners, prospects and clients; \r\n• Provide input towards the product development’s direction. \r\n&nbsp;   Requirements: • Solid business acumen and problem-solving skills; \r\n• Ability to develop strong relationships at all levels of the organization; \r\n• Ability to compile and analyze performance data to develop metrics that support decision making; \r\n• 3-4 years’ experience developing and\/or running product and\/or services strategies or equivalent; \r\n• Experience with technically complex products in a digital marketing\/SEO environment; \r\n• Ability to communicate complex ideas in a clear, concise manner both verbally and in writing; \r\n• Ability to work under pressure and to tight deadlines; \r\n• Strong analytical skills and usage of analytical tools such as: Microsoft Excel; \r\n• Ability to work with key stakeholders to reach mutually beneficial agreements; \r\n• Ability to prioritize and manage multiple responsibilities; \r\n• Ability to thrive in an ambiguous environment; \r\n• Strong project management skills; \r\n&nbsp; We Offer An exciting opportunity to be part of a&nbsp;dynamic global organization and work with experienced professionals. You will discover a&nbsp;high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n\r\nConfidentiality is guaranteed. \r\nPlease send your CV in English. Only successful candidates will be contacted. &nbsp;   \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=8657248d-02ed-4fb4-968d-40c8870f0f39"
    },
    "15": {
        "title": "Head of B2C",
        "location": "Barcelona",
        "date": "25 April 2018",
        "content": "As the Head of B2C you will be building and excecuting a sales strategy for our sales and media teams to drive business development and increase profit. You would be overseeing and managing the following teams: sales, media buy and affiliates. &nbsp;   &nbsp;   Key responsibilities:   • To develop a strategy and key relationships with our current partners and continue to grow our client base in line with our company goals;   • Identifying valuable emerging markets;   • Accurately forecasting future sales and forming sales plans to adapt to constant shifts in the marketplace;   • Serving as a business representative at major industry events, conferences, trade shows, and expositions;   • Maximising company profit;   • Foreseeing and avoiding stagnation in the marketplace;   • Forming sales strategies to keep our company competitive and innovative;   • Relentlessly create revenue growth through innovative strategies and meticulous execution to deliver step change improvements in performance;   • Analyze campaigns for effectiveness and ROI, including understanding and defining marketing-sourced, marketing-influenced campaigns and revenue impact;   • To develop talent within the organization, mentoring\/developing team.     &nbsp;     Requirements:   • Solid business acumen, and problem-solving skills;   • Digital marketing experience (media campaigns, social media, PPC);   • Previous experience in the affiliate business;   • Ability to develop strong relationships at all levels of the organisation;   • Strong leader and people manager;   • Ability to compile and analyse performance data to develop metrics that support decision making;   • 2-4 years of experience in sales or service strategies;   • Ability to communicate complex ideas in a clear, concise manner both verbally and in writing;   • Ability to work under pressure and to tight deadlines.   • To demonstrate independent thinking and good clear judgement. Motivate sales teams to achieve targets. Logical and well organised with exceptional attention to detail; &nbsp; We Offer An exciting opportunity to be part of a&nbsp;dynamic global organization and work with experienced professionals. You will discover a&nbsp;high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n\r\nConfidentiality is guaranteed. \r\nPlease send your CV in English. Only successful candidates will be contacted. &nbsp;   \tDepartment:  \tB2C",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=c4544e54-b8b2-422b-b84c-4f7785a772a7"
    },
    "16": {
        "title": "Outreach Specialist",
        "location": "Barcelona, Spain",
        "date": "02 May 2018",
        "content": "We at&nbsp; iBus &nbsp;Media are looking for&nbsp;enthusiastic and highly motivated individuals&nbsp;to&nbsp;fill&nbsp;available&nbsp; Outreach Specialist &nbsp;positions&nbsp;in&nbsp;our&nbsp;ever-expanding&nbsp;Content Marketing and Outreach&nbsp;Department&nbsp;(CMOD).&nbsp;All&nbsp; Outreach Specialist&nbsp; will work&nbsp;directly&nbsp;under the supervision of the&nbsp;Outreach&nbsp;Manager&nbsp;to develop and implement&nbsp;outreach&nbsp;strategies&nbsp;in order&nbsp;to&nbsp;scale existing content marketing and outreach efforts.&nbsp;If you are looking to join a talented&nbsp;team&nbsp;and are looking for an&nbsp;opportunity for professional growth please send us your CV and cover letter (in English)&nbsp;with subject “ Outreach Specialist “.&nbsp; \r\n &nbsp;\r\n  Duties and Responsibilities: &nbsp; B2B Outreach&nbsp; Suggest and help implement outreach strategy improvements&nbsp; Outreach partner portfolio development&nbsp; Ensure content marketing quality standards and guidelines are being implemented.&nbsp; &nbsp;\r\n  Essential &nbsp; Skills: &nbsp; B2B outreach and\/or&nbsp;sales experience&nbsp; Nordic or german language to a full professional proficiency&nbsp;English language to a full professional proficiency&nbsp;A passion for connecting with people and all things internet.\r\n &nbsp; Desired Skills: &nbsp; Inbound marketing (SEO) knowledge or experience&nbsp; A&nbsp;good&nbsp;understanding of&nbsp;SEO and web&nbsp;positioning&nbsp;metrics&nbsp; Experience with web analytic software such as Google Analytics, Open site Explorer, Majestic and SEMrush Content marketing experience&nbsp;&nbsp;&nbsp;  \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=b529ca46-bd6d-479a-8cce-61f01d16b0b5"
    },
    "17": {
        "title": "SEO Analyst",
        "location": "Barcelona",
        "date": "02 May 2018",
        "content": "The SEO Analyst is the key member of the team for analysing the effectiveness of the Stars Group SEO efforts and that of its competitors. Reporting into the Head of SEO, the SEO Analyst is responsible for investigating trends and ranking issues, allowing the SEO strategy to be driven by analysis of all relevant data points. Key Responsibilities Production of regular business reports allowing key stakeholders to be kept up to date with SEO performance. Bespoke Investigations into ranking issues using all relevant data sources and building reports on these investigation with actionable insights. Analysis of the effectiveness of campaigns and BAU activities. Analysis of competitor activities and search engine performance. Maintenance and management of key SEO tools especially ranking reports and link reports. Analysis of inbound links to Stars Group web properties to assist Stars Group in defending itself from negative SEO tactics. \r\n Skills and Capabilities &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; Data Analysis skills, especially database management and data science skills. Ability to analyse large datasets and derive coherent conclusions and trends from the data. Good coherent communication skills. Excellent reporting and presentation skills. Some knowledge of SEO and ranking factors. Excellent Excel skills. Ability to work with people with a wide variety of different skills, including editors, marketers, SEO specialists and developers. Fluent English. Self-motivated with the ability to work without constant supervision. \r\n Desirable: Knowledge of SEO platforms including Google Search Console, MajesticSEO, A hrefs, SEOMoz etc. Experience of doing keyword research. Experience of optimising and ranking websites. Experience of other online marketing channels. Experience and knowledge attribution models. Company offers: An exciting opportunity to be part of a dynamic global organization and work with experienced professionals. You will discover a high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential.  \tDepartment:  \tB2B",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=ba5d9bba-0ad2-4033-a09b-5fcb959188ea"
    },
    "18": {
        "title": "Account Manager",
        "location": "Barcelona",
        "date": "14 May 2018",
        "content": "Job Purpose: \r\n\r\nThe Account Manager will build and lead Paid Social, Display and PPC execution in different platforms. Is responsible for managing the Groups customer acquisition, reactivation and brand exposure through Social, Search and Media platforms.  \r\nThis person will participate in building world class campaigns; plan, execute and report the marketing activities for PSP in line with the Group management approved Digital Marketing strategy and budget. \r\nThis person will recommend, test and implement new advertising technology relevant to drive PSP activities forward for the business and apply industry best practices to help deliver integrated digital campaigns. \r\n\r\nKey Responsibilities: \r\n\r\n• Plan, negotiate, buy, develop and manage global digital marketing campaigns with a large panel of websites and mobile applications, directly with media owners, through social platforms, search and programmatic platforms and through our mobile media agency (Standard display, Mobile, Digital Video, VOD); \r\n• Manage day to day relationships with search engine providers, Social media platforms and Display networks in order to stay up to date on upcoming changes and trends; \r\n• Control assigned budgets and devise ways of spending efficiently; \r\n• Hands on media planning, media buying and media analysis, the role involves constant optimization of global and local campaigns to meet CPA based goals; \r\n• Define and implement marketing strategies to promote all our web properties (mobile and desktop) : familiar with prospecting, remarketing strategies as well as existing player reengagement strategies; \r\n• Own campaign performance and report on performance; \r\n• Bid management - ensure bids are successfully made to achieve optimum placing of our products online; \r\n• Test creative messaging, landing pages and campaigns to optimise performance continuously; \r\n• Compile and report on campaign effectiveness, including competitive landscape, KPIs and recommendations on opportunities for growth; \r\n• Gathering actionable data from various sources and report to different stakeholders to help ensuring consistent and continual optimization of paid search campaigns; \r\n• Use data to drive decision making process; \r\n• Collaborate with teams across the company to ideate, influence and implement initiatives that will promote the mobile App and desktop software to current and potential customers; \r\n• Provide recommendations and execute strategies for keyword opportunities, campaign structuring, targeting, day partying, and other facets of paid search in accordance with Business Units goals; \r\n• Manage and execute creative process underpinning the advertising strategy; \r\n• Keeping up to date with innovations in digital display advertising and better ways of targeting mainstream gambling audiences. \r\n\r\nSkills and Capabilities: \r\n\r\n• Deep knowledge of digital marketing across Display Medias, PPC, Facebook, Twitter and emerging Social platforms; \r\n• Strong background on Mobile Marketing; \r\n• Proven experience in managing complex PPC campaigns with a history of driving ROI for the business; \r\n• Relevant Digital Marketing experience, and\/or Global Marketing Campaigns execution; \r\n• Knowledge of UI\/UX; \r\n• History of building and managing successful internal and external client and partner relationships; \r\n• Advanced negotiation skills; \r\n• Proven knowledge of budget management for execution of, retargeting, mobile and social media marketing campaigns; \r\n• Excellent communication, project management and presentation skills; \r\n• Excellent numeric skills and attention to detail; \r\n• Ability to effectively multi-task in a deadline driven atmosphere; \r\n• Ability to clearly and effectively articulate thoughts and points; \r\n• Committed with a continuous focus on Group goals and achieving positive results; \r\n• Capacity to work effectively in a highly complex, diverse, changing environment. \r\nCompany offers: An exciting opportunity to be part of a dynamic global organization and work with experienced professionals. You will discover a high performing, driven and supportive working culture and outstanding developmental possibilities to increase your potential. \r\n<\/p>",
        "apply_link": "https:\/\/ibusmedialimited.peoplehr.net\/Pages\/JobBoard\/Opening.aspx?v=106985f7-509a-4c41-a318-de2fbdc14fd7"
    }
}